DataProcessors/БП_РасчетРейтингаПоПравиламРанжировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>БП_РасчетРейтингаПоПравиламРанжировки</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроводитьДокументУР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПравилаРасчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчетаРейтинга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_ПравилаРанжировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НоменклатураПоПравилу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчетаРейтинга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БП_ПравилаРанжировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРассчитанной</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МІСТО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Прибыль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Приоритет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаУЦ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейтинг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РейтингРасчитан</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПравилоРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПравилаРасчетаЦен_СД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Поставщики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыУР</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокУР</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.БП_УстановкаРейтингаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦеныРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ДаНет_сд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ДаНет_сд</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Да</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Нет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/БП_УстановкаРейтингаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>БП_УстановкаРейтингаНоменклатуры</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БП_РейтингНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦеныРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>99</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейтинг</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/БП_РасчетРейтингаПоПравиламРанжировки/Ext/ObjectModule.bsl
Процедура ЗаполнитьПравила() Экспорт 
	Если Отладка тогда
		Сообщить("Заповнення правил ранжування рейтингу.");
	КонецЕсли;

	ПравилаРасчета.Очистить();
	
	Запрос_Правила = новый Запрос;
	Запрос_Правила.Текст = "ВЫБРАТЬ
	|	БП_ПравилаРанжировки.Ссылка КАК ПравилоРасчетаРейтинга,
	|	БП_ПравилаРанжировки.Приоритет КАК Приоритет,
	|	БП_ПравилаРанжировки.ВидНоменклатуры,
	|	БП_ПравилаРанжировки.ТипЦеныРасчета
	|ИЗ
	|	Справочник.БП_ПравилаРанжировки КАК БП_ПравилаРанжировки
	|ГДЕ
	|	НЕ БП_ПравилаРанжировки.ПометкаУдаления
	|	И НЕ БП_ПравилаРанжировки.НеИспользуется
	|	И НЕ БП_ПравилаРанжировки.ЭтоГруппа
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	Рез_Правила = Запрос_Правила.Выполнить().Выгрузить();
	
	
	ПравилаРасчета.Загрузить(Рез_Правила);
	
КонецПроцедуры	

Процедура  ВыполнитьВсе(ТЗНоменклатура = Неопределено) Экспорт 
	
	ДатаДокументов = ТекущаяДата();
	ПроводитьДокументУР = Истина;
	
	ЗаполнитьПравила(); 
	
	Если НЕ ПравилаРасчета.Количество() тогда
		Возврат;
	КонецЕсли;
	
	Если Отладка тогда
		Сообщить("Заповнення номенклатури на основі правил розрахунку цін.");
	КонецЕсли;     
	
	Если ТЗНоменклатура = Неопределено тогда 
		НоменклатураПоПравилу.Загрузить(Обработки.СозданиеУЦ_По_ПравиламРасчета_СД.ПередатьНоменклатуруКРасчетуРейтинга());
	Иначе
		НоменклатураПоПравилу.Загрузить(ТЗНоменклатура);		
	КонецЕсли;
	РасчитатьРейтинг();
	СоздатьДокументы(); 
	УдалитьУстановкиРейтингаКромеПоследних10();
	
КонецПроцедуры  

Процедура УдалитьУстановкиРейтингаКромеПоследних10()

	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	БП_УстановкаРейтингаНоменклатуры.Ссылка КАК Ссылка,
	|	БП_УстановкаРейтингаНоменклатуры.Дата КАК Дата,
	|	БП_УстановкаРейтингаНоменклатуры.Номер КАК Номер
	|ИЗ
	|	Документ.БП_УстановкаРейтингаНоменклатуры КАК БП_УстановкаРейтингаНоменклатуры
	|
	|УПОРЯДОЧИТЬ ПО
	|	БП_УстановкаРейтингаНоменклатуры.Дата УБЫВ";

	Выборка = Запрос.Выполнить().Выбрать();

	Счетчик = 0;
	Удалено = 0;

	Пока Выборка.Следующий() Цикл

		Счетчик = Счетчик + 1;

		Если Счетчик <= 10 Тогда
			Сообщить("Оставляем документ №" + Строка(Счетчик) + ": " 
				+ Строка(Выборка.Номер) + " от " + Строка(Выборка.Дата));
			Продолжить;
		КонецЕсли;

		Попытка
			
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();

			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;

			ДокОбъект.Удалить();

			Удалено = Удалено + 1;

			Сообщить("Удален документ: " 
				+ Строка(Выборка.Номер) + " от " + Строка(Выборка.Дата));

		Исключение

			Сообщить("Ошибка удаления документа: " 
				+ Строка(Выборка.Номер) + " от " + Строка(Выборка.Дата) 
				+ ". Ошибка: " + ОписаниеОшибки());

		КонецПопытки;

	КонецЦикла;

	Сообщить("Всего документов найдено: " + Строка(Счетчик));
	Сообщить("Удалено документов: " + Строка(Удалено));
	Сообщить("Оставлено документов: " + Строка(Мин(Счетчик, 10)));

	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
Процедура РасчитатьРейтинг() Экспорт
	
	
	Для каждого СтрПравило из ПравилаРасчета цикл
		ПравилоРасчетаРейтинга = СтрПравило.ПравилоРасчетаРейтинга;
		Отбор = Новый Структура("ВидНоменклатуры, ТипЦеныРассчитанной", СтрПравило.ВидНоменклатуры, СтрПравило.ТипЦеныРасчета);
		СтрокиНоменклатуры = НоменклатураПоПравилу.НайтиСтроки(Отбор);	
		ИтогоСтрок = СтрокиНоменклатуры.Количество();
		
		Для каждого СтрНоменклатура из СтрокиНоменклатуры цикл
			РейтингВНаличии = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.ВНаличии, СтрНоменклатура.ПравилоРасчета.ВНаличии);
			РейтингСезоны = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.Сезоны, СтрНоменклатура.Номенклатура.Сезонность);
			РейтингНоменклатура = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.Номенклатура, СтрНоменклатура.Номенклатура); 
			РейтингТипыНоменклатуры = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.ТипыНоменклатуры, СтрНоменклатура.Номенклатура.Тип);
			РейтингПроизводители = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.Производители, СтрНоменклатура.Номенклатура.Производитель);
			РейтингМодель = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.Модель, СтрНоменклатура.Номенклатура.Модель);
			РейтингГорода = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.Города, СтрНоменклатура.МІСТО); 
			РейтингПоставщики = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.ПоставщикиТекст, СтрНоменклатура.Поставщик); 
			РейтингБУ = ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.БУ, ?(СтрНоменклатура.Номенклатура.БУ,Перечисления.ДаНет_сд.Да,Перечисления.ДаНет_сд.Нет));
			
			РейтингДоговораКонтрагента = 0;
			Для каждого СтрДоговор из СтрНоменклатура.ПравилоРасчета.ДоговораКонтрагента цикл
				РейтингДоговораКонтрагента = РейтингДоговораКонтрагента + ПолучитьРейтингПоЗначению(ПравилоРасчетаРейтинга.ДоговораКонтрагента,СтрДоговор.ДоговорКонтрагента);	
			КонецЦикла;
			
			РейтингПрибыль = 0;
			Если ПравилоРасчетаРейтинга.НачислятьРейтингЗаПрибыль тогда
				РейтингПрибыль = СтрНоменклатура.Прибыль;	
			КонецЕсли;

			РейтингКоличество = 0;
			Если ПравилоРасчетаРейтинга.НачислятьРейтингЗаКоличество тогда
				РейтингКоличество = СтрНоменклатура.Остаток;	
			КонецЕсли;

			
			Рейтинг = РейтингВНаличии + РейтингСезоны + РейтингНоменклатура + РейтингТипыНоменклатуры + РейтингПроизводители + РейтингМодель + РейтингГорода + РейтингПоставщики + РейтингБУ + РейтингДоговораКонтрагента + РейтингПрибыль + РейтингКоличество;
			
			Если Отладка тогда
				Сообщить("[" + Строка(СтрНоменклатура.НомерСтроки) + "/" + Строка(ИтогоСтрок) + "]. "
							+ "Для номенклатури [" + Строка(СтрНоменклатура.Номенклатура) + "] встановлено рейтинг [" + Рейтинг + "]" + ", що складається з наступних показників:  "
							+ "наявність товару [" + Строка(РейтингВНаличии) + "], " 
							+ "сезоність [" + Строка(РейтингСезоны) + "], "
							+ "номенклатура [" + Строка(РейтингНоменклатура) + "], "
							+ "тип номенклатури [" + Строка(РейтингТипыНоменклатуры) + "], "
							+ "виробник [" + Строка(РейтингПроизводители) + "], "
							+ "модель [" + Строка(РейтингМодель) + "], "
							+ "місто [" + Строка(РейтингГорода) + "], "
							+ "постачальник [" + Строка(РейтингПоставщики) + "], "
							+ "б/у [" + Строка(РейтингБУ) + "], "
							+ "договора контрагентов [" + Строка(РейтингДоговораКонтрагента) + "]"
				            + ?(ПравилоРасчетаРейтинга.НачислятьРейтингЗаПрибыль, ", прибуток [" + Строка(РейтингПрибыль) + "]","")
				            + ?(ПравилоРасчетаРейтинга.НачислятьРейтингЗаКоличество, ", кількість [" + Строка(РейтингКоличество) + "]","")
							);
			КонецЕсли;
			
			СтрНоменклатура.Рейтинг = Рейтинг; 
			СтрНоменклатура.ПравилоРасчетаРейтинга = ПравилоРасчетаРейтинга;
			СтрНоменклатура.РейтингРасчитан = Истина;
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры   

Функция ПолучитьРейтингПоЗначению(ТЗ,Значение) Экспорт
	
	НайденнаяСтрока = ТЗ.Найти(Значение, "Значение");
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат 0;	
	Иначе
		Возврат НайденнаяСтрока.Рейтинг;
	КонецЕсли;
	
КонецФункции  

Процедура СоздатьДокументы() Экспорт    
	Если Отладка тогда
		Сообщить("Створення документів Встановлення рейтингу номенклатури.");
	КонецЕсли;
	ДатаДокументаУР = ДатаДокументов;
	
	НоменклатураПоПравилу.Сортировать("Рейтинг УБЫВ,Номенклатура");
	Для Каждого Стр_Правило из  ПравилаРасчета Цикл
		ПравилоРасчетаРейтинга = Стр_Правило.ПравилоРасчетаРейтинга;
		
		СтруктПрав = новый Структура;
		СтруктПрав.Вставить("ТипЦеныРассчитанной", Стр_Правило.ТипЦеныРасчета);
		СтруктПрав.Вставить("ВидНоменклатуры", Стр_Правило.ВидНоменклатуры); 
		СтруктПрав.Вставить("ПравилоРасчетаРейтинга", ПравилоРасчетаРейтинга);
		СтруктПрав.Вставить("РейтингРасчитан", Истина);  
		
		Строки_ПоПравилу = НоменклатураПоПравилу.НайтиСтроки(СтруктПрав);
		
		Если Строки_ПоПравилу.Количество() = 0 Тогда 
			Продолжить;
		КонецЕсли;
		
		НовДокументУР = Документы.БП_УстановкаРейтингаНоменклатуры.СоздатьДокумент();
		НовДокументУР.Дата = ДатаДокументаУР;
		НовДокументУР.УстановитьНовыйНомер();
		НовДокументУР.ВидНоменклатуры = Стр_Правило.ВидНоменклатуры;
        НовДокументУР.ТипЦеныРасчета = Стр_Правило.ТипЦеныРасчета;   
		
		Товары = НовДокументУР.Товары;
		Для каждого СтрНом из Строки_ПоПравилу цикл
			НовСтрока = Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока,СтрНом);
		КонецЦикла;                                    
		
		Если ПроводитьДокументУР тогда
			НовДокументУР.Записать(РежимЗаписиДокумента.Проведение);
		Иначе  
			НовДокументУР.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		Сообщить("Успішно створено документ: " + Строка(НовДокументУР.Ссылка));
	КонецЦикла;
		
КонецПроцедуры
